In [9]:
import pandas

In [11]:
ms.__version__

'1.3.4'

In [2]:
import pandas as ms

In [4]:
a=ms.Series(['ONE','two','three',4,5],index=[0,1,2,3,4])

In [5]:
print(a)

0      ONE
1      two
2    three
3        4
4        5
dtype: object

In [6]:
VAC=ms.Series([201,202,204,205,208],index=[1,2,3,4,5])

In [7]:
print(VAC)

1    201
2    202
3    204
4    205
5    208
dtype: int64

In [8]:
season={"rainy":{1:'oct',2:'nov',3:'dec',4:'jan'},"dry":{1:'mar',2:'apr',3:'may'}}

In [9]:
clm=ms.DataFrame(season,columns=["rainy","dry"])

In [10]:
print(clm)

  rainy  dry
1   oct  mar
2   nov  apr
3   dec  may
4   jan  NaN

In [11]:
trend={"month":{1:'jan',2:'mar',3:'may',4:'july'},"product":{1:'sugercane',2:'ice cream',3:'watermelan',4:'cone'}}

In [12]:
trend=ms.DataFrame(trend,columns=["month","product"])

In [13]:
trend

  month     product
1   jan   sugercane
2   mar   ice cream
3   may  watermelan
4  july        cone

In [14]:
print(trend)

  month     product
1   jan   sugercane
2   mar   ice cream
3   may  watermelan
4  july        cone

In [15]:
import numpy as mk

In [16]:
q=ms.DataFrame(mk.random.randint(0,200,size=(100,6)),columns=list(('mnopqr')))

In [17]:
print(q)

      m    n    o    p    q    r
0   196   27  193  172   67  154
1    70    8   81   24  140   63
2    41  128   93   52  151  158
3    32  182   19  149   76   35
4    79   83  105   14   80   11
..  ...  ...  ...  ...  ...  ...
95   67  176  152  148   65   65
96  175  141  180  132  152  170
97  180  152   59   51  199   72
98  110  100   47  175  127   67
99   62   21   61  108   64  127

[100 rows x 6 columns]

In [18]:
q.to_csv('D:\jupiter notebook\pm.csv')

In [19]:
m=ms.read_csv('D:/jupiter notebook/pm.csv')

In [20]:
m

    Unnamed: 0    m    n    o    p    q    r
0            0  196   27  193  172   67  154
1            1   70    8   81   24  140   63
2            2   41  128   93   52  151  158
3            3   32  182   19  149   76   35
4            4   79   83  105   14   80   11
..         ...  ...  ...  ...  ...  ...  ...
95          95   67  176  152  148   65   65
96          96  175  141  180  132  152  170
97          97  180  152   59   51  199   72
98          98  110  100   47  175  127   67
99          99   62   21   61  108   64  127

[100 rows x 7 columns]

In [21]:
m.drop("p",axis=1)

    Unnamed: 0    m    n    o    q    r
0            0  196   27  193   67  154
1            1   70    8   81  140   63
2            2   41  128   93  151  158
3            3   32  182   19   76   35
4            4   79   83  105   80   11
..         ...  ...  ...  ...  ...  ...
95          95   67  176  152   65   65
96          96  175  141  180  152  170
97          97  180  152   59  199   72
98          98  110  100   47  127   67
99          99   62   21   61   64  127

[100 rows x 6 columns]

In [22]:
s=m.drop("p",axis=1)

In [23]:
s

    Unnamed: 0    m    n    o    q    r
0            0  196   27  193   67  154
1            1   70    8   81  140   63
2            2   41  128   93  151  158
3            3   32  182   19   76   35
4            4   79   83  105   80   11
..         ...  ...  ...  ...  ...  ...
95          95   67  176  152   65   65
96          96  175  141  180  152  170
97          97  180  152   59  199   72
98          98  110  100   47  127   67
99          99   62   21   61   64  127

[100 rows x 6 columns]

In [24]:
m.shape

(100, 7)

In [25]:
m.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  100 non-null    int64
 1   m           100 non-null    int64
 2   n           100 non-null    int64
 3   o           100 non-null    int64
 4   p           100 non-null    int64
 5   q           100 non-null    int64
 6   r           100 non-null    int64
dtypes: int64(7)
memory usage: 5.6 KB